ttrftech/LPC4370SDR-FM/src/main.c
int32_t capture_count;


//#define CAPTUREBUFFER		((uint8_t*)0x20000000)
//#define CAPTUREBUFFER		((uint8_t*)0x10080000)
#define CAPTUREBUFFER		((uint8_t*)0x20000000)
#define CAPTUREBUFFER_SIZE	0x10000

#define NCO_SIN_BUFFER		((uint8_t*)0x1008F000)
#define NCO_COS_BUFFER		((uint8_t*)0x1008F800)
#define NCO_BUFFER_SIZE		0x800
#define NCO_SAMPLES			1024
#define NCO_AMPL			(SHRT_MAX / 16)
//#define NCO_AMPL			(SHRT_MAX / 4)

#define DECIMATE			32

#define INTERMEDIATE_SAMPLE_RATE	312500000

#define I_FIR_STATE			((q15_t*)0x10080000)
#define I_FIR_BUFFER		((q15_t*)0x10080040)
#define Q_FIR_STATE			((q15_t*)0x10084040)
#define Q_FIR_BUFFER		((q15_t*)0x10084080)
/*  0x10000 / 2 / 32 */
#define FIR_BUFFER_SIZE		0x400
#define FIR_STATE_SIZE		0x40

//#define FIR_GAIN			(16-8)
#define FIR_GAIN			(16-4)
//#define FIR_GAIN			(16)

#define DEMOD_BUFFER 		((q15_t*)0x10088000)
#define DEMOD_BUFFER_SIZE	0x800
#define RESAMPLE_STATE 		((q15_t*)0x10089000)
#define RESAMPLE_STATE_SIZE	0x100
#define RESAMPLE_BUFFER 	((q15_t*)0x10089100)
#define RESAMPLE_BUFFER_SIZE 0x400

#define AUDIO_SAMPLE_RATE	48000

#define AUDIO_BUFFER 		((q15_t*)0x1008A000)
#define AUDIO_BUFFER_SIZE	0x2000
#define AUDIO_BUFFER2 		((q15_t*)0x1008C000)




/*
 * DSP Processing
 */

#define NCO_CYCLE 1024
#define NCO_SAMPLES 1024
#define NCO_COS_OFFSET (NCO_CYCLE/4)

static void ConfigureNCOTable(int freq)
{
	int i;
	int16_t *costbl = (int16_t*)NCO_SIN_BUFFER;
	int16_t *sintbl = (int16_t*)NCO_COS_BUFFER;
	for (i = 0; i < NCO_SAMPLES; i++) {
		float32_t phase = 2*PI*freq*(i+0.5)/NCO_CYCLE;
		costbl[i] = (int16_t)(arm_cos_f32(phase) * NCO_AMPL);
		sintbl[i] = (int16_t)(arm_sin_f32(phase) * NCO_AMPL);
	}
}

#define FIR_NUM_TAPS			32

q15_t fir_coeff[FIR_NUM_TAPS] = {
			-204,   -42,   328,   144,  -687,  -430,  1301,  1060, -2162,
		   -2298,  3208,  4691, -4150, -9707,  3106, 22273, 22273,  3106,
		   -9707, -4150,  4691,  3208, -2298, -2162,  1060,  1301,  -430,
			-687,   144,   328,   -42,  -204
};

typedef struct {
	int32_t s0;
	int32_t s1;
	int32_t s2;
	int32_t d0;
	int32_t d1;
	int32_t d2;
	int32_t dest;
} CICState;

static CICState cic_i;
static CICState cic_q;

static void cic_decimate_i(CICState *cic, uint8_t *buf, int len)
{
	const uint32_t offset = 0x08000800;
	int16_t *const result = (int16_t*)I_FIR_BUFFER;
	uint32_t *capture = (uint32_t*)buf;
	const uint32_t *nco_base = (uint32_t*)NCO_SIN_BUFFER;
	const uint32_t *nco = nco_base;

	int32_t s0 = cic->s0;
	int32_t s1 = cic->s1;
	int32_t s2 = cic->s2;
	int32_t d0 = cic->d0;
	int32_t d1 = cic->d1;
	int32_t d2 = cic->d2;
	int32_t e0, e1, e2;
	uint32_t f;
	uint32_t x;
	int i, j, k, l;

	l = cic->dest;
	for (i = 0; i < len / 4; ) {
		nco = nco_base;
		for (j = 0; j < NCO_SAMPLES/2; ) {
			for (k = 0; k < DECIMATE / 2; k++) {
				x = capture[i++];
				f = *nco++;
				x = __SSUB16(x, offset);
				s0 = __SMLAD(x, f, s0);
				s1 += s0;
				s2 += s1;
				j++;
			}
			e0 = d0 - s2;
			d0 = s2;
			e1 = d1 - e0;
			d1 = e0;
			e2 = d2 - e1;
			d2 = e1;
			result[l++] = e2 >> FIR_GAIN;
			l %=  FIR_BUFFER_SIZE/2;
		}
	}
	cic->dest = l;
	cic->s0 = s0;
	cic->s1 = s1;
	cic->s2 = s2;
	cic->d0 = d0;
	cic->d1 = d1;
	cic->d2 = d2;
}

static void cic_decimate_q(CICState *cic, uint8_t *buf, int len)
{
	const uint32_t offset = 0x08000800;
	int16_t *const result = (int16_t*)Q_FIR_BUFFER;
	uint32_t *capture = (uint32_t*)buf;
	const uint32_t *nco_base = (uint32_t*)NCO_COS_BUFFER;
	const uint32_t *nco = nco_base;

	int32_t s0 = cic->s0;
	int32_t s1 = cic->s1;
	int32_t s2 = cic->s2;
	int32_t d0 = cic->d0;
	int32_t d1 = cic->d1;
	int32_t d2 = cic->d2;
	int32_t e0, e1, e2;
	uint32_t f;
	uint32_t x;
	int i, j, k, l;

	l = cic->dest;
	for (i = 0; i < len / 4; ) {
		nco = nco_base;
		for (j = 0; j < NCO_SAMPLES/2; ) {
			for (k = 0; k < 16; k++) {
				x = capture[i++];
				f = *nco++;
				x = __SSUB16(x, offset);
				s0 = __SMLAD(x, f, s0);
				s1 += s0;
				s2 += s1;
				j++;
			}
			e0 = d0 - s2;
			d0 = s2;
			e1 = d1 - e0;
			d1 = e0;
			e2 = d2 - e1;
			d2 = e1;
			result[l++] = e2 >> FIR_GAIN;
			l %=  FIR_BUFFER_SIZE/2;
		}
	}
	cic->dest = l;
	cic->s0 = s0;
	cic->s1 = s1;
	cic->s2 = s2;
	cic->d0 = d0;
	cic->d1 = d1;
	cic->d2 = d2;
}

#if 0
void fir_filter_i()
{
	const uint32_t *coeff = (uint32_t*)fir_coeff;
	const uint32_t *in_i = (const uint32_t *)I_FIR_STATE;
	int32_t length = FIR_BUFFER_SIZE / sizeof(uint32_t);
	uint32_t *dest = (uint32_t *)DEMOD_BUFFER;
	int i, j;

	for (i = 0; i < length; i++) {
		q31_t acc0_i = 0;
		q31_t acc1_i = 0;
		uint32_t x0 = in_i[0];
		for (j = 0; j < FIR_NUM_TAPS / 2; ) {
			uint32_t c0 = coeff[j];
			uint32_t x2 = in_i[++j];
			acc0_i = __SMLAD(x0, c0, acc0_i);
			uint32_t x1 = __PKHBT(x2, x0, 0);
			acc1_i = __SMLADX(x1, c0, acc1_i);
			x0 = x2;
		}
		dest[i] = __PKHBT(__SSAT((acc0_i >> 15), 16), __SSAT((acc1_i >> 15), 16), 16);
		in_i++;
	}

	uint32_t *state_i = (uint32_t *)I_FIR_STATE;
	for (i = 0; i < FIR_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state_i++ = *in_i++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (in_i) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state_i));
	}
}
#endif

void fir_filter_iq()
{
	const uint32_t *coeff = (uint32_t*)fir_coeff;
	const uint32_t *in_i = (const uint32_t *)I_FIR_STATE;
	const uint32_t *in_q = (const uint32_t *)Q_FIR_STATE;
	int32_t length = FIR_BUFFER_SIZE / sizeof(uint32_t);
	uint32_t *dest = (uint32_t *)DEMOD_BUFFER;
	int i, j;

	for (i = 0; i < length; i++) {
		q31_t acc0_i = 0;
		q31_t acc1_i = 0;
		q31_t acc0_q = 0;
		q31_t acc1_q = 0;
		uint32_t x0 = in_i[0];
		uint32_t y0 = in_q[0];
		for (j = 0; j < FIR_NUM_TAPS / 2; ) {
			uint32_t c0 = coeff[j++];
			uint32_t x2 = in_i[j];
			uint32_t y2 = in_q[j];
			acc0_i = __SMLAD(x0, c0, acc0_i);
			acc0_q = __SMLAD(y0, c0, acc0_q);
			acc1_i = __SMLADX(__PKHBT(x2, x0, 0), c0, acc1_i);
			acc1_q = __SMLADX(__PKHBT(y2, y0, 0), c0, acc1_q);
			x0 = x2;
			y0 = y2;
		}
		dest[i*2] = __PKHBT(__SSAT((acc0_i >> 15), 16), __SSAT((acc0_q >> 15), 16), 16);
		dest[i*2+1] = __PKHBT(__SSAT((acc1_i >> 15), 16), __SSAT((acc1_q >> 15), 16), 16);
		in_i++;
		in_q++;
	}

	uint32_t *state_i = (uint32_t *)I_FIR_STATE;
	for (i = 0; i < FIR_STATE_SIZE; i += 4) {
		//*state_i++ = *in_i++;
	    __asm__ volatile ("ldr r0, [%0, %2]\n"
	    				  "str r0, [%1, %2]\n" :: "l"(in_i), "l"(state_i), "X"(i): "r0");
	}
	uint32_t *state_q = (uint32_t *)Q_FIR_STATE;
	for (i = 0; i < FIR_STATE_SIZE; i += 4) {
		//*state_q++ = *in_q++;
	    __asm__ volatile ("ldr r0, [%0, %2]\n"
	    				  "str r0, [%1, %2]\n" :: "l"(in_q), "l"(state_q), "X"(i): "r0");
	}
}

