ttrftech/LPC4370SDR-FM/src/main.c
struct {
	uint32_t last;
} fm_demod_state;

void fm_demod()
{
	uint32_t *src = (uint32_t *)DEMOD_BUFFER;
	int16_t *dest = (int16_t *)RESAMPLE_BUFFER;
	int32_t length = DEMOD_BUFFER_SIZE / sizeof(uint32_t);
	int i;

	uint32_t x0 = fm_demod_state.last;
	for (i = 0; i < length; i++) {
		uint32_t x1 = src[i];
		int32_t d = __SMUSDX(__SSUB16(x1, x0), x1);
		int32_t n = __SMUAD(x1, x1) >> 12;
		int16_t y = d / n;
		dest[i] = y;
		x0 = x1;
	}
	fm_demod_state.last = x0;
}

#define RESAMPLE_NUM_TAPS	128

q15_t resample_fir_coeff_even[RESAMPLE_NUM_TAPS] = {
		  0,   0,   0,  -1,  -2,  -3,  -4,  -5,  -6,  -8, -10, -12, -14,
		       -16, -18, -21, -23, -26, -28, -30, -32, -33, -35, -35, -35, -34,
		       -33, -31, -27, -23, -17, -10,  -2,   7,  18,  30,  44,  59,  75,
		        93, 112, 132, 153, 175, 197, 220, 244, 268, 291, 315, 338, 361,
		       383, 404, 424, 442, 459, 474, 487, 498, 508, 514, 519, 521, 521,
		       519, 514, 508, 498, 487, 474, 459, 442, 424, 404, 383, 361, 338,
		       315, 291, 268, 244, 220, 197, 175, 153, 132, 112,  93,  75,  59,
		        44,  30,  18,   7,  -2, -10, -17, -23, -27, -31, -33, -34, -35,
		       -35, -35, -33, -32, -30, -28, -26, -23, -21, -18, -16, -14, -12,
		       -10,  -8,  -6,  -5,  -4,  -3,  -2,  -1,   0,   0,   0};
q15_t resample_fir_coeff_odd[RESAMPLE_NUM_TAPS] = {
		  0,   0,  -1,  -1,  -2,  -3,  -4,  -6,  -7,  -9, -11, -13, -15,
		       -17, -20, -22, -24, -27, -29, -31, -33, -34, -35, -35, -35, -34,
		       -32, -29, -25, -20, -14,  -6,   2,  12,  24,  37,  51,  67,  84,
		       102, 122, 142, 164, 186, 209, 232, 256, 280, 303, 327, 350, 372,
		       394, 414, 433, 451, 467, 481, 493, 503, 511, 517, 521, 522, 521,
		       517, 511, 503, 493, 481, 467, 451, 433, 414, 394, 372, 350, 327,
		       303, 280, 256, 232, 209, 186, 164, 142, 122, 102,  84,  67,  51,
		        37,  24,  12,   2,  -6, -14, -20, -25, -29, -32, -34, -35, -35,
		       -35, -34, -33, -31, -29, -27, -24, -22, -20, -17, -15, -13, -11,
		        -9,  -7,  -6,  -4,  -3,  -2,  -1,  -1,   0,   0};

// 312.5kHz * 2/13 -> 48.076923kHz

struct {
	int index;
	float deemphasis_mult;
	float deemphasis_rest;
	float deemphasis_value;
} resample_state;

struct {
	int write_current;
	int write_total;
	int read_total;
	int read_current;
} audio_state;

void
deemphasis_init(int timeconst_us)
{
	resample_state.deemphasis_value = 0;
	resample_state.deemphasis_mult = exp(-1e6/(timeconst_us * AUDIO_SAMPLE_RATE));
	resample_state.deemphasis_rest = 1 - resample_state.deemphasis_mult;
}

void resample_fir_filter2()
{
	const uint32_t *coeff;
	const uint16_t *src = (const uint16_t *)RESAMPLE_STATE;
	const uint32_t *s;
	int32_t tail = RESAMPLE_BUFFER_SIZE;
	int idx = resample_state.index;
	int32_t acc;
	int i, j;
	int cur = audio_state.write_current;
	uint16_t *dest = (uint16_t *)AUDIO_BUFFER;
	float value = resample_state.deemphasis_value;

	while (idx < tail) {
		if (idx & 0x1)
			coeff = (uint32_t*)resample_fir_coeff_odd;
		else
			coeff = (uint32_t*)resample_fir_coeff_even;

		acc = 0;
		s = (const uint32_t*)&src[idx >> 1];
		for (j = 0; j < RESAMPLE_NUM_TAPS / 2; j++) {
			acc = __SMLAD(*s++, *coeff++, acc);
		}

		value = (float)acc * resample_state.deemphasis_rest + value * resample_state.deemphasis_mult;
		dest[cur++] = __SSAT(((int32_t)value >> 12), 16);
		cur %= AUDIO_BUFFER_SIZE / 2;
		audio_state.write_total++;
		//dest[cur++] = __PKHBT(__SSAT((acc0 >> 15), 16), __SSAT((acc1 >> 15), 16), 16);
		idx += 13;
		//idx += 59;
	}
	resample_state.deemphasis_value = value;
	audio_state.write_current = cur;
	resample_state.index = idx - tail;
	uint32_t *state = (uint32_t *)RESAMPLE_STATE;
	src = &src[tail / sizeof(*src)];
	for (i = 0; i < RESAMPLE_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state++ = *src++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (src) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state));
	}
}
#if 0
void resample_fir_filter()
{
	const uint32_t *coeff;
	const uint32_t *src = (const uint32_t *)RESAMPLE_STATE;
	int32_t tail = RESAMPLE_BUFFER_SIZE;
	int idx = resample_state.index;
	uint32_t acc;
	uint32_t x0, c0, x1, x2;
	int i, j;
	int cur = resample_state.current;
	uint16_t *dest = (uint16_t *)AUDIO_BUFFER;

	while (idx < tail) {
		int cls = idx & 0x3;
		i = idx >> 2;

		switch (cls) {
		case 0:
		case 2:
			coeff = (uint32_t*)resample_fir_coeff_even;
			break;
		case 1:
		case 3:
			coeff = (uint32_t*)resample_fir_coeff_odd;
			break;
		}

		acc = 0;
		switch (cls) {
		case 0:
		case 1:
			for (j = 0; j < RESAMPLE_NUM_TAPS / 2; ) {
				x0 = src[i+j];
				c0 = coeff[j++];
				acc = __SMLAD(x0, c0, acc);
			}
			break;
		case 2:
		case 3:
			x0 = src[i];
			for (j = 0; j < RESAMPLE_NUM_TAPS / 2; ) {
				c0 = coeff[j++];
				x2 = src[i+j];
				x1 = __PKHBT(x2, x0, 0);
				acc = __SMLADX(x1, c0, acc);
				x0 = x2;
			}
			break;
		}
		dest[cur++] = __SSAT((acc >> 15), 16);
		cur %= AUDIO_BUFFER_SIZE / 2;
		//dest[cur++] = __PKHBT(__SSAT((acc0 >> 15), 16), __SSAT((acc1 >> 15), 16), 16);
		idx += 13;
	}

	resample_state.current = cur;
	resample_state.index = idx - tail;
	uint32_t *state = (uint32_t *)RESAMPLE_STATE;
	src = &src[tail / sizeof(*src)];
	for (i = 0; i < RESAMPLE_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state++ = *src++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (src) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state));
	}
}
#endif

void DMA_IRQHandler (void)
{
  if (LPC_GPDMA->INTERRSTAT & 1)
  {
    LPC_GPDMA->INTERRCLR = 1;
  }

//#define MEMCPY __aeabi_memcpy8

  if (LPC_GPDMA->INTTCSTAT & 1)
  {
	LPC_GPDMA->INTTCCLEAR = 1;
	//LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests

	//TOGGLE_MEAS_PIN_3();
    const int length = CAPTUREBUFFER_SIZE / 2;
	SET_MEAS_PIN_3();
    if ((capture_count & 1) == 0) {
    	//MEMCPY(DEST_BUFFER, CAPTUREBUFFER, length);
    	cic_decimate_i(&cic_i, CAPTUREBUFFER, length);
    	cic_decimate_q(&cic_q, CAPTUREBUFFER, length);
    } else {
    	//MEMCPY(DEST_BUFFER + length, CAPTUREBUFFER + length, length);
    	//MEMCPY(DEST_BUFFER, CAPTUREBUFFER + length, length);
    	cic_decimate_i(&cic_i, CAPTUREBUFFER + length, length);
    	cic_decimate_q(&cic_q, CAPTUREBUFFER + length, length);
    }
	fir_filter_iq();
	fm_demod();
	resample_fir_filter2();
    CLR_MEAS_PIN_3();
    capture_count ++;
  }
}

