ttrftech/LPC4370SDR-FM/src/main.c
	int i;
	int16_t *buf = (int16_t*)AUDIO_BUFFER2;
	for (i = 0; i < 0x1000; i++) {
		float res = arm_sin_f32((float)i * 2 * PI * 440 / 48000);
		buf[i] = (int)(res * 20000.0);
	}

    while(1) {
        //i++ ;
        if ((capture_count % 2048) == 2047) {
        	//int i;
//        	LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests
            //printf("write:%d read:%d\n", audio_state.write_total, audio_state.read_total);
//        	GPIO_SetValue(0,1<<8);

        	//int length = CAPTUREBUFFER_SIZE / 2;
        	//memset(DEST_BUFFER, 0, DEST_BUFFER_SIZE);
            //cic_decimate(&cic1, CAPTUREBUFFER, length);

        	//GPIO_SetValue(0,1<<8);
        	//SET_MEAS_PIN_3();
        	//fir_filter_iq();
        	//fm_demod();
//        	resample_fir_filter2();
#if 0
    		q15_t *src = I_DEST_BUFFER;
    		q15_t *dst = I_FIR_BUFFER;
        	for (i = 0; i < FIR_NUM_BLOCKS; i++) {
        		arm_fir_fast_q15(&fir, src, dst, FIR_BLOCK_SIZE);
        		src += FIR_BLOCK_SIZE;
        		dst += FIR_BLOCK_SIZE;
        	}
#endif
        	//CLR_MEAS_PIN_3();
        } else if ((capture_count % 2048) < 1024) {
        	GPIO_SetValue(0,1<<8);
    	} else
        	GPIO_ClearValue(0,1<<8);
        //if ((i & 0x1fffff) == 0x100000)
        //	printf("%d\n", i);
#if 0
        {
        	uint32_t txLevel = I2S_GetLevel(LPC_I2S0, I2S_TX_MODE);
        	int rest = audio_state.write_total - audio_state.read_total;
        	if (txLevel <= 4) {
        		// Fill the remaining FIFO
        		int cur = audio_state.read_current;
        		int16_t *buffer = (int16_t*)AUDIO_BUFFER2;
        		//int16_t *buffer = (int16_t*)AUDIO_BUFFER;
        		int i;
        		for (i = 0; i < (8 - txLevel); i++) {
        			LPC_I2S0->TXFIFO = *(uint32_t *)&buffer[cur];
        			cur += 2;
        			cur %= AUDIO_BUFFER_SIZE / 2;
        			audio_state.read_total += 2;
        		}
        		audio_state.read_current = cur;
            }
        }
#endif
    }
	VADC_Stop();
    return 0 ;
}
